Examples/old_cases/HartmannProblem/LESbase/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];



Ical				Ical_var;
kp 				k_var;

internalField   uniform $kp;  

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       $Ical;
		value           uniform $kp;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $kp;
        value           uniform $kp;
    }
    ".*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
